In [2]:
import pandas as pd

In [4]:
df=pd.read_csv("titanic.csv")

In [6]:
##Group Titanic by Pclass
##Compute average Age and survival rate per class

df.groupby("pclass")[["age","survived"]].mean()

              age  survived
pclass
1       38.233441  0.655914
2       29.877630  0.479769
3       25.140620  0.239437

In [10]:
##Group by Sex
##Count passengers per gender.

df.groupby("sex").size()

sex
female    261
male      453
dtype: int64

In [16]:
##Pivot Table:
##Show average Fare by Pclass and Sex.

df.pivot_table(values="fare",index="pclass",columns="sex",aggfunc="mean")

sex         female       male
pclass
1       107.946275  71.142781
2        21.951070  21.113131
3        15.875369  12.162695